#+TITLE: Exercises
#+LANGUAGE: en

** Exercise 1.1.
*** Below is a sequence of expressions. What is the result printed by the interpreter in response to each expression? Assume that the sequence is to be evaluated in the order in which it is presented.

#+BEGIN_SRC scheme
  10                                   ;; 10
  (+ 5 3 4)                            ;; 12
  (- 9 1)                              ;; 8
  (/ 6 2)                              ;; 3
  (+ (* 2 4) (- 4 6))                  ;; 6
  (define a 3)                         ;; 3
  (define b (+ a 1))                   ;; 4
  (+ a b (* a b))                      ;; 19 (the sum of 3 distinct values)
  (= a b)                              ;; #f

  (if (and (> b a) (< b (* a b)))
      b
      a)                               ;; 4 (first value = if, second value = else)

  (cond ((= a 4) 6)
	((= b 4) (+ 6 7 a))
	(else 25))                     ;; 16

  (+ 2 (if (> b a) b a))               ;; 6

  (* (cond ((> a b) a)
	   ((< a b) b)
	   (else -1))
     (+ a 1))                          ;; 16
#+END_SRC

** Exercise 1.2.
*** Translate the expression (https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/ch1-Z-G-3.gif) into prefix form
#+BEGIN_SRC scheme
  (/ (+ 5 
	4 
	(- 2 (- 3 (+ 6 (/ 4 5))))) 
     (* 3 
	(- 6 2) 
	(- 2 7)))  ;; -37/150
#+END_SRC

** Exercise 1.3.
*** Define a procedure that takes three numbers as arguments and returns the sum of the squares of the two larger numbers.
#+BEGIN_SRC scheme
  (define (square x) (* x x))
  (define (sum-squares ( + (square x) (square y))))

  (define (sumOfLargestTwoSquared x y z) 
    (cond ((and (>= (+ x y) (+ y z)) (>= (+ x y) (+ x z))) (sum-squares x y)) 
	  ((and (>= (+ x z) (+ y z)) (>= (+ x z) (+ x y))) (sum-squares x z)) 
	  (else (squareSum y z)) 
	  ) 
    ) 

  (sumOfLargestTwoSquared 1 0 0) ;; 1
  (sumOfLargestTwoSquared 1 2 3) ;; 13
  (sumOfLargestTwoSquared 3 9 0) ;; 90
#+END_SRC

** Exercise 1.4.
*** Observe that our model of evaluation allows for combinations whose operators are compound expressions. Use this observation to describe the behavior of the following procedure:

#+BEGIN_SRC scheme
  ;; Wut?
  (define (a-plus-abs-b a b)
    ((if (> b 0) + -) a b))
#+END_SRC

#+RESULTS:
: #<unspecified>

** Exercise 1.5.
*** Ben Bitdiddle has invented a test to determine whether the interpreter he is faced with is using applicative-order evaluation or normal-order evaluation. He defines the following two procedures:

#+BEGIN_SRC scheme
(define (p) (p))

(define (test x y)
  (if (= x 0)
      0
      y))
#+END_SRC

#+RESULTS:
: #<unspecified>

Then he evaluates the expression

#+BEGIN_SRC scheme
(test 0 (p))
#+END_SRC

#+RESULTS:

What behavior will Ben observe with an interpreter that uses applicative-order evaluation? What behavior will he observe with an interpreter that uses normal-order evaluation? Explain your answer. (Assume that the evaluation rule for the special form if is the same whether the interpreter is using normal or applicative order: The predicate expression is evaluated first, and the result determines whether to evaluate the consequent or the alternative expression.) 
